Revit 2026 API

# ColorFillSchemeGetSupportedParameterIds Method

---

Retrieves collection of all parameters supported by the scheme.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<ElementId> GetSupportedParameterIds()
```
```vb
Public Function GetSupportedParameterIds As IList(Of ElementId)
```
```cpp
public:
IList<ElementId^>^ GetSupportedParameterIds()
```
```fsharp
member GetSupportedParameterIds : unit -> IList<ElementId>
```

#### Return Value

IListElementId

Supported parameters depends on CategoryId property.

#### Reference

ColorFillScheme Class

Autodesk.Revit.DB Namespace